## Plan for org_account/main
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                   NAME                    |
|--------|-------------------------------------------|
| add    | `aws_kms_key.critical_sns_cloudwatch_key` |
|        | `aws_kms_key.warning_sns_cloudwatch_key`  |
| update | `aws_sns_topic.critical`                  |
|        | `aws_sns_topic.warning`                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_kms_key.critical_sns_cloudwatch_key will be created
  + resource "aws_kms_key" "critical_sns_cloudwatch_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for Critical CloudWatch SNS topics"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::659087519042:root"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = (known after apply)
    }

  # aws_kms_key.warning_sns_cloudwatch_key will be created
  + resource "aws_kms_key" "warning_sns_cloudwatch_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for Warning CloudWatch SNS topics"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::659087519042:root"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = (known after apply)
    }

  # aws_sns_topic.critical will be updated in-place
  ~ resource "aws_sns_topic" "critical" {
        id                                       = "arn:aws:sns:ca-central-1:659087519042:critical-issue"
      + kms_master_key_id                        = (known after apply)
        name                                     = "critical-issue"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.warning will be updated in-place
  ~ resource "aws_sns_topic" "warning" {
        id                                       = "arn:aws:sns:ca-central-1:659087519042:warning-issue"
      + kms_master_key_id                        = (known after apply)
        name                                     = "warning-issue"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.publishing_bucket.aws_s3_bucket.this,
  on .terraform/modules/publishing_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 9 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cds_sentinel_securityhub_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ct_list_controls"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.azure_sentinel"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cds_sentinel_guard_duty_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.critical_sns_cloudwatch_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.warning_sns_cloudwatch_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.cloudtrail_sqs_queue"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_aft_management_detector.aws_guardduty_detector.ca_central_1"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_aft_management_detector.aws_guardduty_detector.us_east_1"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_aft_management_detector.aws_guardduty_detector.us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_audit_detector.aws_guardduty_detector.ca_central_1"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_audit_detector.aws_guardduty_detector.us_east_1"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_audit_detector.aws_guardduty_detector.us_west_2"]
WARN - plan.json - main - Missing Common...
```

</details>
